* NEEM
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | NEEM
Place name                       | NEEM
Geographic location              | Northwest Greenland
Ice type                         | Ice sheet
Data Source                      | Clow email
Data DOI                         | 
Science Source                   | Rasmussen, S., P. Abbott, T. Blunier et al. 2013. A first chronology for the North Greenland Eemian Ice Drilling (NEEM) ice core. Climate of the Past. 9: 2713-2730.
Science DOI                      | 10.5194/cp-9-2713-2013
Date                             | 2011-05-27
Longitude [°E]                   | -51.06
Latitude [°N]                    | 77.45
Location Source                  | Dahl-Jensen, D., Albert, Mary R., Aldahan, A., Azuma, N., Balslev-Clausen, D., Baumgartner, M., Berggren, A. -M., Bigler, M., Binder, T., Blunier, T., Bourgeois, J. C., Brook, E. J., Buchardt, S. L., Buizert, C., Capron, E., Chappellaz, J., Chung, J., Clausen, H. B., Cvijanovic, I., Davies, S. M., Ditlevsen, P., Eicher, O., Fischer, H., Fisher, D. A., Fleet, L. G., Gfeller, G., Gkinis, V., Gogineni, S., Goto-Azuma, K., Grinsted, A., Gudlaugsdottir, H., Guillevic, M., Hansen, S. B., Hansson, M., Hirabayashi, M., Hong, S., Hur, S. D., Huybrechts, Philippe, Hvidberg, C. S., Iizuka, Y., Jenk, T., Johnsen, S. J., Jones, T. R., Jouzel, J., Karlsson, N. B., Kawamura, K., Keegan, K., Kettner, E., Kipfstuhl, S., Kjær, H. A., Koutnik, M., Kuramoto, T., Koehler, P., Laepple, T., Landais, A., Langen, P. L., Larsen, L. B., Leuenberger, D., Leuenberger, M., Leuschen, C., Li, J., Lipenkov, V., Martinerie, P., Maselli, O. J., Masson-Delmotte, V., McConnell, J. R., Miller, H., Mini, O., Miyamoto, A., Montagnat-Rentier, M., Mulvaney, R., Muscheler, Raimund, Orsi, A. J., Paden, J., Panton, C., Pattyn, F., Petit, J. -R., Pol, K., Popp, T., Possnert, G., Prie, F., Prokopiou, M., Quiquet, A., Rasmussen, S. O., Raynaud, D., Ren, J., Reutenauer, C., Ritz, C., Rockmann, T., Rosen, J. L., Rubino, M., Rybak, O., Samyn, D., Sapart, C. J., Schilt, A., Schmidt, A. M. Z., Schwander, J., Schuepbach, S., Seierstad, I., Severinghaus, J. P., Sheldon, S., Simonsen, S. B., Sjolte, Jesper, Solgaard, A. M., Sowers, T., Sperlich, P., Steen-Larsen, H. C., Steffen, K., Steffensen, J. P., Steinhage, D., Stocker, T. F., Stowasser, C., Sturevik, A. S., Sturges, W. T., Sveinbjornsdottir, A., Svensson, A., Tison, J. -L., Uetake, J., Vallelonga, P., van de Wal, R. S. W., van der Wel, G., Vaughn, B. H., Vinther, B., Waddington, E., Wegner, A., Weikusat, I., White, J. W. C., Wilhelms, F., Winstrup, M., Witrant, E., Wolff, E. W., Xiao, C., Zheng, J.: Eemian interglacial reconstructed from a Greenland folded ice core , Nature 493(7433), Nature Publishing Group, 489–494, 2013 
Depth of top measurement [m]     | 81.0
Depth of bottom measurement [m]  | 2535
Ice thickness [m]                | 2535
Coverage [% of thickness]        | 97
Ice thickness source             | G. Clow email
Note                             | 
#+end_example

** Temperature

+ Data provided by G. Clow

#+BEGIN_example
From: Gary D Clow
To: Ken Mankoff
Cc: William Colgan, Dorthe Dahl-Jensen
Subject: NEEM temperature profile
Date: Tue 02 Feb 2021 04:37:18 PM PST
Attachments: [1]NEEM-D_11MAY27b_5m.txt(11.9K), [2]NEEM_Tz.jpg(1.9M),
 [3]NEEM_dTdz.jpg(285.1K), [4]TM2E3_508.pdf(5.6M)

Attached is the temperature log from the main NEEM borehole. The log
was acquired with the USGS Polar Temperature Logging System on 27
May 2011. The load cell indicated we hit bottom at 2534.5 m below
surface. The attached log has been denoised to remove instrumental
noise and deconvolved to account for the motion of the sensor while
logging. The log has not been corrected for borehole refraction
effects or for the thermal disturbance caused by drilling.
#+END_example

** Thickness

+ Here we use the value reported by G. Clow in email to K. Mankoff
+ Reported as 2540 in [[citet:dahl-jensen_2013][Dahl-Jensen (2013)]].
+ Reported as 2538 in [[citet:macgregor_2016][MacGregor (2016)]], with some extra details in Table 1.

** Location

+ From [[citet:dahl-jensen_2013][Dahl-Jensen (2013)]].

** Velocity

** Data                                                 :noexport:

#+BEGIN_SRC python :results none
import numpy as np
import pandas as pd

df = pd.read_csv('NEEM-D_11MAY27b_5m.txt', sep=' ', skipinitialspace=True, skiprows=24, names=['d','t'], index_col=0)
df.index.name = 'd'
df.to_csv('data.csv')
#+END_SRC

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k1
#+END_SRC

#+RESULTS: ingest_data
|      d |        t |
|  81.29 |  -29.061 |
|   85.0 | -29.0654 |
|   90.0 | -29.0733 |
|   95.0 | -29.0826 |
|  100.0 | -29.0927 |
|  105.0 | -29.1033 |
|  110.0 |  -29.114 |
|  115.0 | -29.1247 |
|  120.0 | -29.1349 |
|  125.0 | -29.1438 |
|  130.0 | -29.1511 |
|  135.0 | -29.1573 |
|  140.0 | -29.1626 |
|  145.0 | -29.1672 |
|  150.0 | -29.1714 |
|  155.0 | -29.1747 |
|  160.0 |  -29.177 |
|  165.0 | -29.1787 |
|  170.0 | -29.1801 |
|  175.0 | -29.1813 |
|  180.0 |  -29.182 |
|  185.0 | -29.1824 |
|  190.0 | -29.1824 |
|  195.0 | -29.1818 |
|  200.0 | -29.1807 |
|  205.0 | -29.1791 |
|  210.0 | -29.1771 |
|  215.0 | -29.1747 |
|  220.0 |  -29.172 |
|  225.0 |  -29.169 |
|  230.0 | -29.1657 |
|  235.0 | -29.1621 |
|  240.0 | -29.1583 |
|  245.0 | -29.1543 |
|  250.0 | -29.1501 |
|  255.0 | -29.1458 |
|  260.0 | -29.1414 |
|  265.0 | -29.1369 |
|  270.0 | -29.1323 |
|  275.0 | -29.1278 |
|  280.0 | -29.1233 |
|  285.0 | -29.1188 |
|  290.0 | -29.1143 |
|  295.0 | -29.1098 |
|  300.0 | -29.1054 |
|  305.0 |  -29.101 |
|  310.0 | -29.0967 |
|  315.0 | -29.0925 |
|  320.0 | -29.0884 |
|  325.0 | -29.0844 |
|  330.0 | -29.0805 |
|  335.0 | -29.0767 |
|  340.0 | -29.0729 |
|  345.0 | -29.0693 |
|  350.0 | -29.0658 |
|  355.0 | -29.0624 |
|  360.0 | -29.0592 |
|  365.0 | -29.0561 |
|  370.0 | -29.0532 |
|  375.0 | -29.0503 |
|  380.0 | -29.0476 |
|  385.0 |  -29.045 |
|  390.0 | -29.0425 |
|  395.0 | -29.0401 |
|  400.0 | -29.0378 |
|  405.0 | -29.0356 |
|  410.0 | -29.0335 |
|  415.0 | -29.0315 |
|  420.0 | -29.0296 |
|  425.0 | -29.0278 |
|  430.0 | -29.0261 |
|  435.0 | -29.0245 |
|  440.0 |  -29.023 |
|  445.0 | -29.0217 |
|  450.0 | -29.0205 |
|  455.0 | -29.0194 |
|  460.0 | -29.0184 |
|  465.0 | -29.0174 |
|  470.0 | -29.0166 |
|  475.0 | -29.0158 |
|  480.0 | -29.0152 |
|  485.0 | -29.0146 |
|  490.0 | -29.0142 |
|  495.0 | -29.0138 |
|  500.0 | -29.0136 |
|  505.0 | -29.0134 |
|  510.0 | -29.0134 |
|  515.0 | -29.0134 |
|  520.0 | -29.0135 |
|  525.0 | -29.0137 |
|  530.0 |  -29.014 |
|  535.0 | -29.0144 |
|  540.0 | -29.0148 |
|  545.0 | -29.0153 |
|  550.0 | -29.0159 |
|  555.0 | -29.0165 |
|  560.0 | -29.0172 |
|  565.0 |  -29.018 |
|  570.0 | -29.0188 |
|  575.0 | -29.0198 |
|  580.0 | -29.0208 |
|  585.0 | -29.0219 |
|  590.0 |  -29.023 |
|  595.0 | -29.0241 |
|  600.0 | -29.0253 |
|  605.0 | -29.0265 |
|  610.0 | -29.0277 |
|  615.0 |  -29.029 |
|  620.0 | -29.0304 |
|  625.0 | -29.0318 |
|  630.0 | -29.0332 |
|  635.0 | -29.0347 |
|  640.0 | -29.0362 |
|  645.0 | -29.0377 |
|  650.0 | -29.0393 |
|  655.0 |  -29.041 |
|  660.0 | -29.0427 |
|  665.0 | -29.0444 |
|  670.0 | -29.0461 |
|  675.0 | -29.0478 |
|  680.0 | -29.0495 |
|  685.0 | -29.0512 |
|  690.0 | -29.0529 |
|  695.0 | -29.0547 |
|  700.0 | -29.0564 |
|  705.0 | -29.0581 |
|  710.0 | -29.0599 |
|  715.0 | -29.0616 |
|  720.0 | -29.0634 |
|  725.0 | -29.0652 |
|  730.0 | -29.0669 |
|  735.0 | -29.0687 |
|  740.0 | -29.0704 |
|  745.0 | -29.0721 |
|  750.0 | -29.0739 |
|  755.0 | -29.0757 |
|  760.0 | -29.0774 |
|  765.0 | -29.0791 |
|  770.0 | -29.0807 |
|  775.0 | -29.0823 |
|  780.0 | -29.0837 |
|  785.0 | -29.0851 |
|  790.0 | -29.0864 |
|  795.0 | -29.0875 |
|  800.0 | -29.0887 |
|  805.0 | -29.0897 |
|  810.0 | -29.0907 |
|  815.0 | -29.0917 |
|  820.0 | -29.0925 |
|  825.0 | -29.0933 |
|  830.0 | -29.0941 |
|  835.0 | -29.0948 |
|  840.0 | -29.0954 |
|  845.0 |  -29.096 |
|  850.0 | -29.0964 |
|  855.0 | -29.0968 |
|  860.0 | -29.0971 |
|  865.0 | -29.0973 |
|  870.0 | -29.0974 |
|  875.0 | -29.0974 |
|  880.0 | -29.0972 |
|  885.0 | -29.0969 |
|  890.0 | -29.0964 |
|  895.0 | -29.0958 |
|  900.0 |  -29.095 |
|  905.0 | -29.0941 |
|  910.0 |  -29.093 |
|  915.0 | -29.0918 |
|  920.0 | -29.0904 |
|  925.0 | -29.0888 |
|  930.0 | -29.0871 |
|  935.0 | -29.0852 |
|  940.0 | -29.0831 |
|  945.0 | -29.0809 |
|  950.0 | -29.0785 |
|  955.0 |  -29.076 |
|  960.0 | -29.0732 |
|  965.0 | -29.0703 |
|  970.0 | -29.0671 |
|  975.0 | -29.0638 |
|  980.0 | -29.0603 |
|  985.0 | -29.0565 |
|  990.0 | -29.0525 |
|  995.0 | -29.0483 |
| 1000.0 | -29.0438 |
| 1005.0 | -29.0391 |
| 1010.0 | -29.0342 |
| 1015.0 |  -29.029 |
| 1020.0 | -29.0235 |
| 1025.0 | -29.0178 |
| 1030.0 | -29.0118 |
| 1035.0 | -29.0055 |
| 1040.0 | -28.9989 |
| 1045.0 | -28.9921 |
| 1050.0 |  -28.985 |
| 1055.0 | -28.9776 |
| 1060.0 |   -28.97 |
| 1065.0 | -28.9621 |
| 1070.0 |  -28.954 |
| 1075.0 | -28.9455 |
| 1080.0 | -28.9367 |
| 1085.0 | -28.9275 |
| 1090.0 | -28.9181 |
| 1095.0 | -28.9083 |
| 1100.0 | -28.8982 |
| 1105.0 | -28.8878 |
| 1110.0 | -28.8769 |
| 1115.0 | -28.8657 |
| 1120.0 | -28.8541 |
| 1125.0 | -28.8423 |
| 1130.0 |   -28.83 |
| 1135.0 | -28.8173 |
| 1140.0 | -28.8041 |
| 1145.0 | -28.7906 |
| 1150.0 | -28.7766 |
| 1155.0 | -28.7625 |
| 1160.0 | -28.7481 |
| 1165.0 | -28.7333 |
| 1170.0 |  -28.718 |
| 1175.0 | -28.7024 |
| 1180.0 | -28.6862 |
| 1185.0 | -28.6693 |
| 1190.0 | -28.6519 |
| 1195.0 |  -28.634 |
| 1200.0 | -28.6157 |
| 1205.0 |  -28.597 |
| 1210.0 |  -28.578 |
| 1215.0 | -28.5586 |
| 1220.0 | -28.5388 |
| 1225.0 | -28.5186 |
| 1230.0 | -28.4979 |
| 1235.0 | -28.4772 |
| 1240.0 | -28.4561 |
| 1245.0 | -28.4345 |
| 1250.0 | -28.4124 |
| 1255.0 | -28.3893 |
| 1260.0 | -28.3653 |
| 1265.0 | -28.3409 |
| 1270.0 | -28.3159 |
| 1275.0 | -28.2901 |
| 1280.0 |  -28.264 |
| 1285.0 | -28.2377 |
| 1290.0 | -28.2109 |
| 1295.0 | -28.1837 |
| 1300.0 |  -28.156 |
| 1305.0 | -28.1276 |
| 1310.0 | -28.0988 |
| 1315.0 | -28.0698 |
| 1320.0 | -28.0403 |
| 1325.0 | -28.0106 |
| 1330.0 |   -27.98 |
| 1335.0 | -27.9485 |
| 1340.0 | -27.9161 |
| 1345.0 | -27.8833 |
| 1350.0 | -27.8502 |
| 1355.0 | -27.8168 |
| 1360.0 | -27.7834 |
| 1365.0 | -27.7497 |
| 1370.0 | -27.7156 |
| 1375.0 | -27.6812 |
| 1380.0 | -27.6457 |
| 1385.0 | -27.6085 |
| 1390.0 | -27.5708 |
| 1395.0 | -27.5322 |
| 1400.0 |  -27.493 |
| 1405.0 | -27.4541 |
| 1410.0 | -27.4163 |
| 1415.0 | -27.3787 |
| 1420.0 | -27.3408 |
| 1425.0 | -27.3015 |
| 1430.0 | -27.2613 |
| 1435.0 | -27.2193 |
| 1440.0 | -27.1754 |
| 1445.0 | -27.1301 |
| 1450.0 | -27.0832 |
| 1455.0 | -27.0342 |
| 1460.0 | -26.9821 |
| 1465.0 | -26.9281 |
| 1470.0 | -26.8727 |
| 1475.0 | -26.8168 |
| 1480.0 | -26.7607 |
| 1485.0 | -26.7073 |
| 1490.0 | -26.6547 |
| 1495.0 | -26.6022 |
| 1500.0 |  -26.551 |
| 1505.0 | -26.5019 |
| 1510.0 | -26.4517 |
| 1515.0 | -26.4008 |
| 1520.0 | -26.3498 |
| 1525.0 | -26.3001 |
| 1530.0 | -26.2501 |
| 1535.0 | -26.1982 |
| 1540.0 | -26.1439 |
| 1545.0 | -26.0898 |
| 1550.0 | -26.0351 |
| 1555.0 | -25.9768 |
| 1560.0 | -25.9246 |
| 1565.0 | -25.8848 |
| 1570.0 | -25.8461 |
| 1575.0 | -25.7907 |
| 1580.0 | -25.7266 |
| 1585.0 | -25.6701 |
| 1590.0 |  -25.617 |
| 1595.0 | -25.5398 |
| 1600.0 | -25.4536 |
| 1605.0 |  -25.336 |
| 1610.0 | -25.1242 |
| 1615.0 | -24.9862 |
| 1620.0 | -24.9747 |
| 1625.0 | -24.9064 |
| 1630.0 | -24.9038 |
| 1635.0 | -24.8675 |
| 1640.0 | -24.8217 |
| 1645.0 | -24.7883 |
| 1650.0 | -24.7684 |
| 1655.0 | -24.7402 |
| 1660.0 | -24.6903 |
| 1665.0 | -24.6219 |
| 1670.0 | -24.5544 |
| 1675.0 |  -24.493 |
| 1680.0 | -24.3623 |
| 1685.0 |  -24.048 |
| 1690.0 | -23.9653 |
| 1695.0 | -23.8895 |
| 1700.0 | -23.4766 |
| 1705.0 | -23.3906 |
| 1710.0 | -23.3815 |
| 1715.0 | -23.3749 |
| 1720.0 |   -23.36 |
| 1725.0 | -23.3539 |
| 1730.0 | -23.3308 |
| 1735.0 | -23.2968 |
| 1740.0 | -23.2622 |
| 1745.0 | -23.2306 |
| 1750.0 | -23.1953 |
| 1755.0 | -23.1584 |
| 1760.0 | -23.1155 |
| 1765.0 | -23.0549 |
| 1770.0 | -22.9853 |
| 1775.0 | -22.9099 |
| 1780.0 | -22.8274 |
| 1785.0 | -22.7418 |
| 1790.0 | -22.7009 |
| 1795.0 | -22.6099 |
| 1800.0 | -22.4792 |
| 1805.0 | -21.8201 |
| 1810.0 | -21.7105 |
| 1815.0 | -21.6899 |
| 1820.0 | -21.6613 |
| 1825.0 | -21.5965 |
| 1830.0 |  -21.505 |
| 1835.0 | -21.4754 |
| 1840.0 | -21.4889 |
| 1845.0 | -21.4225 |
| 1850.0 | -21.3207 |
| 1855.0 | -20.9121 |
| 1860.0 |  -20.841 |
| 1865.0 | -20.7797 |
| 1870.0 | -20.7009 |
| 1875.0 | -20.5846 |
| 1880.0 | -19.9208 |
| 1885.0 | -19.8435 |
| 1890.0 | -19.7982 |
| 1895.0 |  -19.749 |
| 1900.0 | -19.7291 |
| 1905.0 | -19.7263 |
| 1910.0 | -19.7169 |
| 1915.0 | -19.7002 |
| 1920.0 | -19.6758 |
| 1925.0 | -19.6431 |
| 1930.0 | -19.5966 |
| 1935.0 | -19.5506 |
| 1940.0 | -19.5147 |
| 1945.0 | -19.4922 |
| 1950.0 | -19.4776 |
| 1955.0 |  -19.471 |
| 1960.0 | -19.3272 |
| 1965.0 |   -19.28 |
| 1970.0 | -19.2561 |
| 1975.0 | -18.0156 |
| 1980.0 |  -17.927 |
| 1985.0 | -17.8761 |
| 1990.0 | -17.7831 |
| 1995.0 | -17.8241 |
| 2000.0 | -17.8231 |
| 2005.0 | -17.7912 |
| 2010.0 | -17.7746 |
| 2015.0 | -17.7267 |
| 2020.0 | -17.6483 |
| 2025.0 |  -17.563 |
| 2030.0 | -17.0455 |
| 2035.0 | -16.9081 |
| 2040.0 | -16.7469 |
| 2045.0 | -16.6041 |
| 2050.0 | -16.4841 |
| 2055.0 |  -16.372 |
| 2060.0 |  -16.212 |
| 2065.0 | -16.0626 |
| 2070.0 | -15.9564 |
| 2075.0 | -15.8504 |
| 2080.0 | -15.7217 |
| 2085.0 | -15.5826 |
| 2090.0 | -15.4417 |
| 2095.0 | -15.3019 |
| 2100.0 | -15.1691 |
| 2105.0 | -15.0519 |
| 2110.0 | -14.9366 |
| 2115.0 | -14.8178 |
| 2120.0 | -14.6908 |
| 2125.0 | -14.5442 |
| 2130.0 | -14.3832 |
| 2135.0 | -14.2182 |
| 2140.0 | -14.0552 |
| 2145.0 | -13.8956 |
| 2150.0 | -13.7426 |
| 2155.0 | -13.5982 |
| 2160.0 | -13.4594 |
| 2165.0 | -13.3339 |
| 2170.0 | -13.2272 |
| 2175.0 | -13.1379 |
| 2180.0 | -13.0584 |
| 2185.0 | -12.9849 |
| 2190.0 | -12.9165 |
| 2195.0 | -12.8476 |
| 2200.0 | -12.7705 |
| 2205.0 | -12.7082 |
| 2210.0 | -12.6351 |
| 2215.0 | -12.4478 |
| 2220.0 | -12.4366 |
| 2225.0 | -12.2387 |
| 2230.0 | -12.1354 |
| 2235.0 | -11.9544 |
| 2240.0 | -11.8675 |
| 2245.0 | -11.7726 |
| 2250.0 | -11.6004 |
| 2255.0 | -11.3942 |
| 2260.0 | -11.2881 |
| 2265.0 | -11.1719 |
| 2270.0 | -10.9311 |
| 2275.0 | -10.8438 |
| 2280.0 | -10.6549 |
| 2285.0 | -10.5093 |
| 2290.0 | -10.3482 |
| 2295.0 | -10.1927 |
| 2300.0 | -10.0398 |
| 2305.0 |  -9.8922 |
| 2310.0 |  -9.7495 |
| 2315.0 |  -9.6081 |
| 2320.0 |  -9.4689 |
| 2325.0 |  -9.3295 |
| 2330.0 |  -9.1869 |
| 2335.0 |  -9.0445 |
| 2340.0 |  -8.9015 |
| 2345.0 |  -8.7596 |
| 2350.0 |  -8.6182 |
| 2355.0 |  -8.4777 |
| 2360.0 |  -8.3373 |
| 2365.0 |  -8.1963 |
| 2370.0 |  -8.0541 |
| 2375.0 |  -7.9103 |
| 2380.0 |  -7.7665 |
| 2385.0 |   -7.622 |
| 2390.0 |  -7.4778 |
| 2395.0 |  -7.3318 |
| 2400.0 |   -7.184 |
| 2405.0 |  -7.0367 |
| 2410.0 |  -6.8911 |
| 2415.0 |  -6.7505 |
| 2420.0 |  -6.6151 |
| 2425.0 |  -6.4817 |
| 2430.0 |  -6.3486 |
| 2435.0 |  -6.2141 |
| 2440.0 |  -6.0725 |
| 2445.0 |  -5.9276 |
| 2450.0 |    -5.78 |
| 2455.0 |  -5.6324 |
| 2460.0 |  -5.4866 |
| 2465.0 |  -5.3429 |
| 2470.0 |  -5.1987 |
| 2475.0 |  -5.0545 |
| 2480.0 |   -4.909 |
| 2485.0 |   -4.763 |
| 2490.0 |  -4.6166 |
| 2495.0 |  -4.4753 |
| 2500.0 |  -4.3357 |
| 2505.0 |  -4.1913 |
| 2510.0 |  -4.0485 |
| 2515.0 |  -3.9197 |
| 2520.0 |  -3.8099 |
| 2525.0 |  -3.7191 |
| 2530.0 |  -3.6508 |
| 2534.5 |  -3.6054 |

